# SteelElemWeldDoubleSurfaceshape Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SteelElemWeldDoubleSurfaceshape Property
ParameterTypeId Class See Also
---
"Double Surface Shape"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SteelElemWeldDoubleSurfaceshape { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SteelElemWeldDoubleSurfaceshape As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SteelElemWeldDoubleSurfaceshape {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace